#include <iostream>
using namespace std;

int main(){

 
  // بداية الكود هعرف متغيرين
  int x;
  int y;
  
  // هعرف متغير للعمليه سواء + او - او * او /
  char z;
  
  // هطلعله الاسئله
  cout << "Enter First Number : ";
  cin >> x; // خدت قيمة اول رقم وحطيتها في المتغير ده
  
  cout << "Enter Second Number : ";
  cin >> y; // خدت قيمة تاني رقم وخزنته في المتغير ده
  
  cout << "Enter Operation : "; // بسأله عن العمليه 
  cin >> z; // خزنت قيمة العمليه في المتغير ده
  
  // ابدأ شغل بقي
  if (z == '+') { // لو قيمة المتغير اللي هيشيل العمليه زائد يبقي هيجمع
      cout << "Result : " << x + y;
  }else if( z == '-' ){ // لو قيمة المتغير اللي هيشيل العمليه ناقص يبقي هيطرح
      cout << "Result : " << x - y;
  }else if( z == '*' ){ // لو قيمة المتغير اللي هيشيل العمليه نجمه يبقي هيضرب
      cout << "Result : " << x * y;
  }else if( z == '/' ){ // لو قيمة المتغير اللي هيشيل العمليه قسمه يبقي هيقسم
      cout << "Result : " << x / y;
  }else{
      cout << "Please Use ( + | - | / | * ) Only"; // لو حط حاجه غير العمليات هيطلعله الرساله دي
  }
  
  return 0;
 

}
